/**********************************************************************

    IBM EGA CRT Controller emulation

    This controller is very loosely based on the mc6845.

**********************************************************************/

#include "emu.h"
#include "crtc_ega.h"


#define LOG		(0)


/* device types */
enum
{
	TYPE_CRTC_EGA=0,
	TYPE_CRTC_VGA,

	NUM_TYPES
};


/* tags for state saving */
static const char * const device_tags[NUM_TYPES] = { "crtc_ega", "crtc_vga" };


typedef struct _crtc_ega_t crtc_ega_t;
struct _crtc_ega_t
{
	int device_type;
	const crtc_ega_interface *intf;
	screen_device *screen;

	/* ega/vga register file */
	UINT8	horiz_char_total;	/* 0x00 */
	UINT8	horiz_disp;			/* 0x01 */
	UINT8	horiz_blank_start;	/* 0x02 */
	UINT8	horiz_blank_end;	/* 0x03/0x05 */
	UINT8	ena_vert_access;	/* 0x03 */
	UINT8	de_skew;			/* 0x03 */
	UINT8	horiz_retr_start;	/* 0x04 */
	UINT8	horiz_retr_end;		/* 0x05 */
	UINT8	horiz_retr_skew;	/* 0x05 */
	UINT16	vert_total;			/* 0x06/0x07 */
	UINT8	preset_row_scan;	/* 0x08 */
	UINT8	byte_panning;		/* 0x08 */
	UINT8	max_ras_addr;		/* 0x09 */
	UINT8	scan_doubling;		/* 0x09 */
	UINT8	cursor_start_ras;	/* 0x0a */
	UINT8	cursor_disable;		/* 0x0a */
	UINT8	cursor_end_ras;		/* 0x0b */
	UINT8	cursor_skew;		/* 0x0b */
	UINT16	disp_start_addr;	/* 0x0c/0x0d */
	UINT16	cursor_addr;		/* 0x0e/0x0f */
	UINT16	light_pen_addr;		/* 0x10/0x11 */
	UINT16	vert_retr_start;	/* 0x10/0x07 */
	UINT8	vert_retr_end;		/* 0x11 */
	UINT8	protect;			/* 0x11 */
	UINT8	bandwidth;			/* 0x11 */
	UINT16	vert_disp_end;		/* 0x12/0x07 */
	UINT8	offset;				/* 0x13 */
	UINT8	underline_loc;		/* 0x14 */
	UINT16	vert_blank_start;	/* 0x15/0x07/0x09 */
	UINT8	vert_blank_end;		/* 0x16 */
	UINT8	mode_control;		/* 0x17 */
	UINT16	line_compare;		/* 0x18/0x07/0x09 */

	/* other internal state */
	UINT64	clock;
	UINT8	register_address_latch;
	UINT8	hpixels_per_column;
	UINT8	cursor_state;	/* 0 = off, 1 = on */
	UINT8	cursor_blink_count;

	/* timers */
	emu_timer *de_changed_timer;
	emu_timer *hsync_on_timer;
	emu_timer *hsync_off_timer;
	emu_timer *vsync_on_timer;
	emu_timer *vsync_off_timer;
	emu_timer *vblank_on_timer;
	emu_timer *vblank_off_timer;
	emu_timer *light_pen_latch_timer;

	/* computed values - do NOT state save these! */
	UINT16	horiz_pix_total;
	UINT16	vert_pix_total;
	UINT16	max_visible_x;
	UINT16	max_visible_y;
	UINT16	hsync_on_pos;
	UINT16	hsync_off_pos;
	UINT16	vsync_on_pos;
	UINT16	vsync_off_pos;
	UINT16  current_disp_addr;	/* the display address currently drawn */
	UINT8	light_pen_latched;
	int		has_valid_parameters;
};

//static DEVICE_GET_INFO( crtc_vga );

static STATE_POSTLOAD( crtc_ega_state_save_postload );
static void recompute_parameters(crtc_ega_t *crtc_ega, int postload);
